apps/api/test/load-testing/artillery-load-test.yml
# Artillery Load Testing Configuration for CareCircle API
#
# Installation:
# npm install -g artillery
#
# Usage:
# artillery run apps/api/test/load-testing/artillery-load-test.yml
#
# Quick test:
# artillery quick --count 10 --num 100 http://localhost:3001/api/v1/health

config:
  target: "http://localhost:3001"
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up"

    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp-up to 50 users/sec"

    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"

    # Peak load
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"

    # Ramp-down
    - duration: 60
      arrivalRate: 100
      rampTo: 0
      name: "Ramp-down"

  # Performance requirements
  ensure:
    p95: 500  # 95th percentile should be under 500ms
    p99: 1000 # 99th percentile should be under 1s
    maxErrorRate: 1  # Error rate should be under 1%

  # HTTP settings
  http:
    timeout: 10

  # Variables
  variables:
    apiPrefix: "/api/v1"

  # Payload data
  payload:
    path: "./test-data.csv"
    fields:
      - email
      - password
      - fullName
    order: sequence
    skipHeader: true

# Test scenarios
scenarios:
  # Scenario 1: Authentication Flow
  - name: "User Authentication"
    weight: 30
    flow:
      - post:
          url: "{{ apiPrefix }}/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
          expect:
            - statusCode: 200
            - hasProperty: accessToken

      - get:
          url: "{{ apiPrefix }}/auth/me"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          expect:
            - statusCode: 200

  # Scenario 2: Dashboard Operations
  - name: "Dashboard Load"
    weight: 40
    flow:
      - post:
          url: "{{ apiPrefix }}/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"

      - get:
          url: "{{ apiPrefix }}/families"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      - get:
          url: "{{ apiPrefix }}/care-recipients"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      - get:
          url: "{{ apiPrefix }}/notifications"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      - get:
          url: "{{ apiPrefix }}/notifications/unread-count"
          headers:
            Authorization: "Bearer {{ accessToken }}"

      - think: 2  # Pause for 2 seconds (user reading)

  # Scenario 3: Medication Management
  - name: "Medication Operations"
    weight: 20
    flow:
      - post:
          url: "{{ apiPrefix }}/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
            - json: "$.user.families[0].careRecipients[0].id"
              as: "careRecipientId"

      - get:
          url: "{{ apiPrefix }}/medications?careRecipientId={{ careRecipientId }}"
          headers:
            Authorization: "Bearer {{ accessToken }}"
          ifTrue: "careRecipientId"

  # Scenario 4: Real-time Events
  - name: "WebSocket Connections"
    engine: "socketio"
    weight: 10
    flow:
      - emit:
          channel: "connect"
          data:
            token: "{{ accessToken }}"

      - think: 30  # Keep connection open for 30 seconds

      - emit:
          channel: "disconnect"

# Plugins
plugins:
  expect: {}
  metrics-by-endpoint:
    stripQueryString: true

# Report configuration
reporting:
  format: json
  output: ./load-test-results.json

# Custom processor for advanced logic
processor: "./load-test-processor.js"